<script setup>

function mergeAndReplaceFields(data, Field) {
  const mergedData = {};

  // 遍历列表中的每个对象
  data.forEach(obj => {
    // 遍历对象中的键
    Object.keys(obj).forEach(key => {
      // 如果键不存在于合并后的数据中，则将键和对应值添加到合并数据中
      if (!mergedData[key]) {
        mergedData[key] = obj[key];
      } else {
        // 否则，将当前值追加到已存在键的值中
        mergedData[key].push(obj[key][0]);
      }
    });
  });

  // 替换字段值
  const replacedData = {};
  Object.keys(mergedData).forEach(key => {
    const replacedKey = Field[key] || key;
    replacedData[replacedKey] = mergedData[key];
  });

  // 将合并且替换后的数据整合为字符串输出
  let result = '';
  Object.keys(replacedData).forEach(key => {
    result += `<span style="font-weight:bold">${key}:</span><br>${replacedData[key].join('<br>')}<br>`;
  });

  return result;
}

const Field = {
  id: "身份证号",
  sex: "性别",
  admission_date: "入学年份",
  student_id: "准考证号",
  class_num: "班级",
  name: "姓名",
  create_time: "创建时间",
  update_time: "更新时间",
};

const eMsg = [
    {
        "id": [
            "身份证[513323197501303520]已存在"
        ],
        "student_id": [
            "考号[18041822]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303521]已存在"
        ],
        "student_id": [
            "考号[18041823]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303522]已存在"
        ],
        "student_id": [
            "考号[18041824]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303523]已存在"
        ],
        "student_id": [
            "考号[18041825]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303524]已存在"
        ],
        "student_id": [
            "考号[18041826]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303525]已存在"
        ],
        "student_id": [
            "考号[18041827]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303520]已存在"
        ],
        "student_id": [
            "考号[18041822]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303521]已存在"
        ],
        "student_id": [
            "考号[18041823]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303522]已存在"
        ],
        "student_id": [
            "考号[18041824]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303523]已存在"
        ],
        "student_id": [
            "考号[18041825]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303524]已存在"
        ],
        "student_id": [
            "考号[18041826]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303525]已存在"
        ],
        "student_id": [
            "考号[18041827]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303520]已存在"
        ],
        "student_id": [
            "考号[18041822]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303521]已存在"
        ],
        "student_id": [
            "考号[18041823]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303522]已存在"
        ],
        "student_id": [
            "考号[18041824]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303523]已存在"
        ],
        "student_id": [
            "考号[18041825]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303524]已存在"
        ],
        "student_id": [
            "考号[18041826]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303525]已存在"
        ],
        "student_id": [
            "考号[18041827]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303520]已存在"
        ],
        "student_id": [
            "考号[18041822]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303521]已存在"
        ],
        "student_id": [
            "考号[18041823]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303522]已存在"
        ],
        "student_id": [
            "考号[18041824]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303523]已存在"
        ],
        "student_id": [
            "考号[18041825]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303524]已存在"
        ],
        "student_id": [
            "考号[18041826]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303525]已存在"
        ],
        "student_id": [
            "考号[18041827]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303520]已存在"
        ],
        "student_id": [
            "考号[18041822]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303521]已存在"
        ],
        "student_id": [
            "考号[18041823]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303522]已存在"
        ],
        "student_id": [
            "考号[18041824]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303523]已存在"
        ],
        "student_id": [
            "考号[18041825]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303524]已存在"
        ],
        "student_id": [
            "考号[18041826]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303525]已存在"
        ],
        "student_id": [
            "考号[18041827]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303520]已存在"
        ],
        "student_id": [
            "考号[18041822]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303521]已存在"
        ],
        "student_id": [
            "考号[18041823]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303522]已存在"
        ],
        "student_id": [
            "考号[18041824]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303523]已存在"
        ],
        "student_id": [
            "考号[18041825]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303524]已存在"
        ],
        "student_id": [
            "考号[18041826]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303525]已存在"
        ],
        "student_id": [
            "考号[18041827]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303520]已存在"
        ],
        "student_id": [
            "考号[18041822]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303521]已存在"
        ],
        "student_id": [
            "考号[18041823]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303522]已存在"
        ],
        "student_id": [
            "考号[18041824]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303523]已存在"
        ],
        "student_id": [
            "考号[18041825]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303524]已存在"
        ],
        "student_id": [
            "考号[18041826]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303525]已存在"
        ],
        "student_id": [
            "考号[18041827]已存在"
        ]
    }
]

const eMsg2 = [
    {
        "id": [
            "身份证[513323197501303520]已存在"
        ],
        "student_id": [
            "考号[18041822]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303521]已存在"
        ],
        "student_id": [
            "考号[18041823]已存在"
        ]
    },
    {
        "id": [
            "身份证[513323197501303522]已存在"
        ],
        "student_id": [
            "考号[18041824]已存在"
        ]
    },
    {},
    {},
    {}
]

const errorMsgString = mergeAndReplaceFields(eMsg2, Field);
console.log(errorMsgString);

onMounted(() => {
    ElMessageBox.alert(errorMsgString, '导入失败', {
        dangerouslyUseHTMLString: true,
    })
})
</script>

<template>
    我是通知书信息管理
</template>